Tekla.Structures.Datatype.IStringDataType
The IStringDataType interface is an interface for the Tekla.Structures.Datatype.*
types whose value is a string.

Tekla.Structures.Datatype.IStringDataType.Value
The string value of the field.